src/2023-01-14-buy-new-machine.org
#+TITLE: 25 万円で PC パーツ購入
#+DATE: <2023-01-14 Sun>
#+FILETAGS: :buy:

『自作 PC』をやってみます。今回はパーツを購入しました。

* 背景

MacBook Pro (Mid 2015) のバッテリーが膨張していました。蓋が閉まりませんし、そもそも平面に直立しません。この機に新しいパソコンを買い替えてしまいます。

** モチベーション

自作 PC の目的としては、ハードへの苦手意識を解消したいと思います。

逆に目標外なのはコストパフォーマンスです。多少失敗しても経験が買えます。 BTO よりも高額になっても構いません。

** インプット

今が自作 PC 関連の情報を取り込む旬です！

- [[https://backspace.fm/384/][#384:YouTuber瀬戸弘司さんが西川善司さんに自作PCの疑問をとことん相談する]] (backspace.fm)\\
  ユーモラスにふざけていて良かったです。レイドみたいな話も普通に出てきて、知識のアンテナが改善されます。 Youtube の内部実装がプラグインベースというのはさもありなん。
- [[https://info.nikkeibp.co.jp/media/PC21/atcl/books/062100004/][パソコン自作の教科書]]\\
  課金すると真面目に読めます。冒頭では、ラップトップ機と性能比較して自作 PC はコスパが良いと言っていました。据え置き機と比較するよりも角が立たないのかもしれませんが、参考になるかと言われると……
- [[https://www.dospara.co.jp/5info/cts_pc_setup][自作パソコン（自作PC）組立 マニュアル | ドスパラ 自作PC サービス]]\\
  組み立ての時に読むかもしれません。

* PC 購入

** 参考スペック

() の中にベンチマークスコアを記入しています。 GALLERIA なら UE4 が快適らしいので、 GALLERIA クラスのパソコンを組むことにします。

| 構成名             | 総額       | CPU                           | GPU                  | メモリ |
|--------------------+------------+-------------------------------+----------------------+--------|
| [[https://fyrox.rs/][Fyrox Engine]] 作者  | ？         | [[https://browser.geekbench.com/processors/amd-ryzen-7-1700x][Ryzen 1700X]] (892 / 5,979)     | [[http://ftp.videocardbenchmark.net/gpu.php?gpu=GeForce+RTX+2070&id=4001][RTX 2070]] (16,136)    | ？     |
| [[https://github.com/Reputeless/Laptops][Laptops]] ハイエンド | 142,266 円 | Core i7-12700H (?)            | [[https://www.videocardbenchmark.net/gpu.php?gpu=GeForce+RTX+3050+Ti+Laptop+GPU&id=4393][RTX 3050 Ti]] (9,976)  | 16 GB  |
| [[https://www.dospara.co.jp/5shopping/detail_prime.php?mc=12166&sn=0][GALLERIA XA7C-R36T]] | 263,680 円 | [[https://browser.geekbench.com/processors/intel-core-i7-12700][Core i7-12700]] (1,786 / 9,477) | [[https://www.videocardbenchmark.net/gpu.php?gpu=GeForce+RTX+3060+Ti&id=4318][RTX 3060 Ti]] (20,529) | 64 GB  |
| ハイエンド         | ? 円       | (2,241 / 26,701)              | (39,158)             | ? GB   |

** 購入パーツ

全点お店で購入しました。合計 25 万円弱です (Windows を買ったら 26 万円) 。意外にお安くなったと思います。助かりました。

| 項目         | 購入品                      | 値段   | 備考                             |
|--------------+-----------------------------+--------+----------------------------------|
| CPU          | Intel Core i7 12700K        | 60,000 | [[https://browser.geekbench.com/processors/intel-core-i7-12700k][スコア 1,907 / 14,188]]            |
| GPU          | GeForce RTX 3070            | 75,000 | [[https://www.videocardbenchmark.net/gpu.php?gpu=GeForce+RTX+3070&id=4283][スコア 22466]]                     |
| メモリ       | Curucial CT2K32G4DFD83      | 25,000 | 32GB x 2, UDIMM, DDR4-3200       |
| ストレージ   | ADATA AGAMMIXS50L-1T-C      | 20,000 | 1 TB, M.2 2280 PCIe Gen 4.0 NVMe |
| マザーボード | MAG B660 TOMAHAWK WIFI DDR4 | 30,000 | ATX, B660                        |
| 電源         | RM750 2021 CP-9020234       | 13,500 | ATX, 750W, 80PLUS Gold           |
| CPU クーラ   | DEEPCOOL AK620              | 7,980  | サイド                           |
| PC ケース    | DEEPCOOL CH510              | 9,000  | ATX                              |

ネットの値段と比べても、極端に高いことはありません。店内にはぼったくり構成の自作 PC 広告も置いてありましたが、普通に希望スペックを提示して購入する分には問題無いですね。

もちろん自分でパーツを集めれば 2, 3 万円安くなったかもしれませんが、 GALLERIA より安くて強いなら全然満足です。

** お店で聞いたこと

*** この買い方で大丈夫？

- Q. CPU は AMD の方がコスパが良い？ (実際探してみると Intel の方が安かったけれど……)
  A. その情報は数年遅れで、今は Intel の方が断然安いと思う

- Q. 電源は 650 W, 750 W, 850 W のどれにすべき？ (GALLERIA は 650 W)
  A. BTO に比べ自作界隈では電源に余裕を持たせることが多い。 750 W くらいがおすすめ

- Q. RTX 3070 と RTX 3070 Ti はどちらがおすすめ？
  A. RTX 3070 がおすすめ。 Ti との差はほぼ分からないだろう

*** このパーツ大丈夫？

- Q. この CPU / マザーボードの組み合わせがオンライン見積もりツールではミスマッチと出たのだけれど
  A. 問題無い。そのツールはけっこう無茶苦茶なことを言う

- Q. このケース、 USB 端子が 2 つしか無い？
  A. 普通は裏からマザーボードに直接 USB を挿す。ケース表面の端子が無くても問題無い

- Q. このマザーボードは映像端子が 2 つしか無いけれど、 3 つ以上の画面を出すにはどうする？
  A. ビデオカードから映像出力するから問題無い

*** ついでに教えてほしい

- Q. 引越しの際は全パーツを取り外すすべき？
  A. 特にブレる GPU のみ取り外せば良い

- Q. M.2, NVMe, PCIe の違いは？
  A. M.2 は全体の規格、 NVMe は通信仕様、 PCIe は端子の形状 (?)

- Q. 『RTX 3070』というのは規格のこと？
  A. 規格ではなく CPU のチップセットに近い。それでメモリサイズなども定まるし、メーカによる性能差はほぼ無い (オーバークロック時に誤差程度)

* 感想

というわけで最難関が完了しました。結構時間はかけたのですが、ノートパソコンを選ぶのと大差無いですね。シンプルに出来ていて凄いです。

来週は組み立てや Linux install battle をやっていきます。今回も NixOS かな……？

