2023-01-14-buy-new-machine.html
<!DOCTYPE html>
<html lang="ja"><head><meta charset="utf-8"/><meta name="viewport" content="width=device-width, initial-scale=1"/><title>25 万円で PC パーツ購入 - toybeam</title><meta name="description" content="devlog of toyboot4e"/><link rel="stylesheet" href="style/simple.min.css"/><link rel="stylesheet" href="style/style.css"/><link rel="stylesheet" href="style/prism.css"/><!-- MathJax --></head><body><header role="banner"><h1>25 万円で PC パーツ購入</h1><p>Jan 14, 2023</p><nav role="navigation"><a href="/">Home</a><a href="https://github.com/toyboot4e">GitHub</a></nav></header><main role="main"><p>
『自作 PC』をやってみます。今回はパーツを購入しました。<br>
</p>

<div id="outline-container-org0bc149c" class="outline-2">
<h2 id="org0bc149c"><a href="#org0bc149c">背景</a></h2>
<div class="outline-text-2" id="text-org0bc149c">
<p>
MacBook Pro (Mid 2015) のバッテリーが膨張していました。蓋が閉まりませんし、そもそも平面に直立しません。この機に新しいパソコンを買い替えてしまいます。<br>
</p>
</div>

<div id="outline-container-orgd90f865" class="outline-3">
<h3 id="orgd90f865"><a href="#orgd90f865">モチベーション</a></h3>
<div class="outline-text-3" id="text-orgd90f865">
<p>
自作 PC の目的としては、ハードへの苦手意識を解消したいと思います。<br>
</p>

<p>
逆に目標外なのはコストパフォーマンスです。多少失敗しても経験が買えます。 BTO よりも高額になっても構いません。<br>
</p>
</div>
</div>

<div id="outline-container-org70eecff" class="outline-3">
<h3 id="org70eecff"><a href="#org70eecff">インプット</a></h3>
<div class="outline-text-3" id="text-org70eecff">
<p>
今が自作 PC 関連の情報を取り込む旬です！<br>
</p>

<ul class="org-ul">
<li><a href="https://backspace.fm/384/">#384:YouTuber瀬戸弘司さんが西川善司さんに自作PCの疑問をとことん相談する</a> (backspace.fm)<br>
ユーモラスにふざけていて良かったです。レイドみたいな話も普通に出てきて、知識のアンテナが改善されます。 Youtube の内部実装がプラグインベースというのはさもありなん。<br></li>
<li><a href="https://info.nikkeibp.co.jp/media/PC21/atcl/books/062100004/">パソコン自作の教科書</a><br>
課金すると真面目に読めます。冒頭では、ラップトップ機と性能比較して自作 PC はコスパが良いと言っていました。据え置き機と比較するよりも角が立たないのかもしれませんが、参考になるかと言われると……<br></li>
<li><a href="https://www.dospara.co.jp/5info/cts_pc_setup">自作パソコン（自作PC）組立 マニュアル | ドスパラ 自作PC サービス</a><br>
組み立ての時に読むかもしれません。<br></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org82468cc" class="outline-2">
<h2 id="org82468cc"><a href="#org82468cc">PC 購入</a></h2>
<div class="outline-text-2" id="text-org82468cc">
</div>
<div id="outline-container-org16c331a" class="outline-3">
<h3 id="org16c331a"><a href="#org16c331a">参考スペック</a></h3>
<div class="outline-text-3" id="text-org16c331a">
<p>
() の中にベンチマークスコアを記入しています。 GALLERIA なら UE4 が快適らしいので、 GALLERIA クラスのパソコンを組むことにします。<br>
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">構成名</th>
<th scope="col" class="org-left">総額</th>
<th scope="col" class="org-left">CPU</th>
<th scope="col" class="org-left">GPU</th>
<th scope="col" class="org-left">メモリ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://fyrox.rs/">Fyrox Engine</a> 作者</td>
<td class="org-left">？</td>
<td class="org-left"><a href="https://browser.geekbench.com/processors/amd-ryzen-7-1700x">Ryzen 1700X</a> (892 / 5,979)</td>
<td class="org-left"><a href="http://ftp.videocardbenchmark.net/gpu.php?gpu=GeForce+RTX+2070&amp;id=4001">RTX 2070</a> (16,136)</td>
<td class="org-left">？</td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/Reputeless/Laptops">Laptops</a> ハイエンド</td>
<td class="org-left">142,266 円</td>
<td class="org-left">Core i7-12700H (?)</td>
<td class="org-left"><a href="https://www.videocardbenchmark.net/gpu.php?gpu=GeForce+RTX+3050+Ti+Laptop+GPU&amp;id=4393">RTX 3050 Ti</a> (9,976)</td>
<td class="org-left">16 GB</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.dospara.co.jp/5shopping/detail_prime.php?mc=12166&amp;sn=0">GALLERIA XA7C-R36T</a></td>
<td class="org-left">263,680 円</td>
<td class="org-left"><a href="https://browser.geekbench.com/processors/intel-core-i7-12700">Core i7-12700</a> (1,786 / 9,477)</td>
<td class="org-left"><a href="https://www.videocardbenchmark.net/gpu.php?gpu=GeForce+RTX+3060+Ti&amp;id=4318">RTX 3060 Ti</a> (20,529)</td>
<td class="org-left">64 GB</td>
</tr>

<tr>
<td class="org-left">ハイエンド</td>
<td class="org-left">? 円</td>
<td class="org-left">(2,241 / 26,701)</td>
<td class="org-left">(39,158)</td>
<td class="org-left">? GB</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2652caf" class="outline-3">
<h3 id="org2652caf"><a href="#org2652caf">購入パーツ</a></h3>
<div class="outline-text-3" id="text-org2652caf">
<p>
全点お店で購入しました。合計 25 万円弱です (Windows を買ったら 26 万円) 。意外にお安くなったと思います。助かりました。<br>
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">項目</th>
<th scope="col" class="org-left">購入品</th>
<th scope="col" class="org-left">値段</th>
<th scope="col" class="org-left">備考</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CPU</td>
<td class="org-left">Intel Core i7 12700K</td>
<td class="org-left">60,000</td>
<td class="org-left"><a href="https://browser.geekbench.com/processors/intel-core-i7-12700k">スコア 1,907 / 14,188</a></td>
</tr>

<tr>
<td class="org-left">GPU</td>
<td class="org-left">GeForce RTX 3070</td>
<td class="org-left">75,000</td>
<td class="org-left"><a href="https://www.videocardbenchmark.net/gpu.php?gpu=GeForce+RTX+3070&amp;id=4283">スコア 22466</a></td>
</tr>

<tr>
<td class="org-left">メモリ</td>
<td class="org-left">Curucial CT2K32G4DFD83</td>
<td class="org-left">25,000</td>
<td class="org-left">32GB x 2, UDIMM, DDR4-3200</td>
</tr>

<tr>
<td class="org-left">ストレージ</td>
<td class="org-left">ADATA AGAMMIXS50L-1T-C</td>
<td class="org-left">20,000</td>
<td class="org-left">1 TB, M.2 2280 PCIe Gen 4.0 NVMe</td>
</tr>

<tr>
<td class="org-left">マザーボード</td>
<td class="org-left">MAG B660 TOMAHAWK WIFI DDR4</td>
<td class="org-left">30,000</td>
<td class="org-left">ATX, B660</td>
</tr>

<tr>
<td class="org-left">電源</td>
<td class="org-left">RM750 2021 CP-9020234</td>
<td class="org-left">13,500</td>
<td class="org-left">ATX, 750W, 80PLUS Gold</td>
</tr>

<tr>
<td class="org-left">CPU クーラ</td>
<td class="org-left">DEEPCOOL AK620</td>
<td class="org-left">7,980</td>
<td class="org-left">サイド</td>
</tr>

<tr>
<td class="org-left">PC ケース</td>
<td class="org-left">DEEPCOOL CH510</td>
<td class="org-left">9,000</td>
<td class="org-left">ATX</td>
</tr>
</tbody>
</table>

<p>
ネットの値段と比べても、極端に高いことはありません。店内にはぼったくり構成の自作 PC 広告も置いてありましたが、普通に希望スペックを提示して購入する分には問題無いですね。<br>
</p>

<p>
もちろん自分でパーツを集めれば 2, 3 万円安くなったかもしれませんが、 GALLERIA より安くて強いなら全然満足です。<br>
</p>
</div>
</div>

<div id="outline-container-org0f50c52" class="outline-3">
<h3 id="org0f50c52"><a href="#org0f50c52">お店で聞いたこと</a></h3>
<div class="outline-text-3" id="text-org0f50c52">
</div>
<div id="outline-container-orgd6a669e" class="outline-4">
<h4 id="orgd6a669e"><a href="#orgd6a669e">この買い方で大丈夫？</a></h4>
<div class="outline-text-4" id="text-orgd6a669e">
<ul class="org-ul">
<li>Q. CPU は AMD の方がコスパが良い？ (実際探してみると Intel の方が安かったけれど……)<br>
A. その情報は数年遅れで、今は Intel の方が断然安いと思う<br></li>

<li>Q. 電源は 650 W, 750 W, 850 W のどれにすべき？ (GALLERIA は 650 W)<br>
A. BTO に比べ自作界隈では電源に余裕を持たせることが多い。 750 W くらいがおすすめ<br></li>

<li>Q. RTX 3070 と RTX 3070 Ti はどちらがおすすめ？<br>
A. RTX 3070 がおすすめ。 Ti との差はほぼ分からないだろう<br></li>
</ul>
</div>
</div>

<div id="outline-container-org1c2af48" class="outline-4">
<h4 id="org1c2af48"><a href="#org1c2af48">このパーツ大丈夫？</a></h4>
<div class="outline-text-4" id="text-org1c2af48">
<ul class="org-ul">
<li>Q. この CPU / マザーボードの組み合わせがオンライン見積もりツールではミスマッチと出たのだけれど<br>
A. 問題無い。そのツールはけっこう無茶苦茶なことを言う<br></li>

<li>Q. このケース、 USB 端子が 2 つしか無い？<br>
A. 普通は裏からマザーボードに直接 USB を挿す。ケース表面の端子が無くても問題無い<br></li>

<li>Q. このマザーボードは映像端子が 2 つしか無いけれど、 3 つ以上の画面を出すにはどうする？<br>
A. ビデオカードから映像出力するから問題無い<br></li>
</ul>
</div>
</div>

<div id="outline-container-org100c36b" class="outline-4">
<h4 id="org100c36b"><a href="#org100c36b">ついでに教えてほしい</a></h4>
<div class="outline-text-4" id="text-org100c36b">
<ul class="org-ul">
<li>Q. 引越しの際は全パーツを取り外すすべき？<br>
A. 特にブレる GPU のみ取り外せば良い<br></li>

<li>Q. M.2, NVMe, PCIe の違いは？<br>
A. M.2 は全体の規格、 NVMe は通信仕様、 PCIe は端子の形状 (?)<br></li>

<li>Q. 『RTX 3070』というのは規格のこと？<br>
A. 規格ではなく CPU のチップセットに近い。それでメモリサイズなども定まるし、メーカによる性能差はほぼ無い (オーバークロック時に誤差程度)<br></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orge647ba9" class="outline-2">
<h2 id="orge647ba9"><a href="#orge647ba9">感想</a></h2>
<div class="outline-text-2" id="text-orge647ba9">
<p>
というわけで最難関が完了しました。結構時間はかけたのですが、ノートパソコンを選ぶのと大差無いですね。シンプルに出来ていて凄いです。<br>
</p>

<p>
来週は組み立てや Linux install battle をやっていきます。今回も NixOS かな……？<br>
</p>
</div>
</div>
</main><footer role="contentinfo"><p>Styled with <a href="https://simplecss.org/">Simple.css</a></p><div><a href="/">Home</a><a href="https://github.com/toyboot4e">GitHub</a></div></footer></body></html>
